BellerageHackathon/src/Documents/ПубликацияТеста/ПубликацияТеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПубликацияТеста</name>
  <posting>Deny</posting>
  <attributes>
    <name>Тест</name>
    <type>
      <types>CatalogRef.Тесты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияТеста</name>
    <type>
      <types>CatalogRef.ВерсииТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущаяОпубликованнаяВерсия</name>
    <type>
      <types>CatalogRef.ВерсииТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХэшСодержимого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеОбмена</name>
    <type>
      <types>CatalogRef.СообщенияОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

BellerageHackathon/src/Enums/СтатусыВерсийТестов/СтатусыВерсийТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыВерсийТестов</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Опубликована</name>
  </enumValues>
  <enumValues>
    <name>ЗамененаНовой</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Documents/ПубликацияТеста/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЭтоНовый() Тогда
		ВызватьИсключение "Документ публикации является неизменяемым.";
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Тест)
		Или Не ЗначениеЗаполнено(ВерсияТеста) Тогда
		ВызватьИсключение "Не заполнены тест или публикуемая версия.";
	КонецЕсли;

	Если ВерсияТеста.Владелец <> Тест Тогда
		ВызватьИсключение "Публикуемая версия принадлежит другому тесту.";
	КонецЕсли;

	Если ВерсияТеста.СтатусВерсии
		<> Перечисления.СтатусыВерсийТестов.Черновик Тогда
		ВызватьИсключение "Публиковать можно только черновую версию.";
	КонецЕсли;

	Если ПустаяСтрока(ХэшСодержимого)
		Или Не ЗначениеЗаполнено(СообщениеОбмена) Тогда
		ВызватьИсключение "Не заполнены хэш или сообщение обмена.";
	КонецЕсли;

#Если Сервер Тогда
	УправлениеВерсиямиТестовСервер
		.ПроверитьИВызватьИсключениеПередПубликацией(ВерсияТеста);
#КонецЕсли

КонецПроцедуры

Процедура ПередУдалением(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Отказ = Истина;
	ВызватьИсключение "Документ публикации нельзя удалять.";

КонецПроцедуры
